app/controllers/api/v1/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    render json: Customer.all

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    render json: Customer.find(params[:id])