app/controllers/api/v1/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    render json: Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    render json: Item.find(params[:id])