app/controllers/api/v1/merchants_controller.rb

SELECT "merchants".* FROM "merchants"
---
  def index
    render json: Merchant.all

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    render json: Merchant.find(params[:id])