app/controllers/api/v1/transactions_controller.rb

  def index
    render json: Transaction.all
---
SELECT "transactions".* FROM "transactions"

  def show
    render json: Transaction.find(params[:id])
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]