app/controllers/api/v1/items/find_controller.rb

  def show
    render json: Item.find_by(search_params)
---
SELECT  "items".* FROM "items" WHERE "items"."updated_at" = $1 LIMIT $2  [["updated_at", "2012-03-27T14:54:05.000Z"], ["LIMIT", 1]]